Repository: collective/collective.autopublishing
Catalog: collective/autopublishing/locales/*/LC_MESSAGES/collective.autopublishing.po
Languages: fr

source: Autopublishing
fr: Publication automatique

source: Content types
fr: Types de contenus

source: If enabled autopublishing can be enabled for individual objects
fr: Permet d'activer la publication automatique individuellement sur les contenus

source: Installs the collective.autopublishing package
fr: Installe le module de publication automatique

source: Show report:
fr: Consulter le rapport d'audit:

source: Uninstalls the collective.autopublishing module
fr: Désinstalle le module de publication automatique

source: What actions wil be taken by the next run?
fr: Voir quelles actions seront initiées lors de la prochaine exécution

source: enableAutopublishing
fr: Activer la publication automatique

source: help_ap_controlpanel
fr: Configure les actions de processus documentaire que la publication automatique va faire.

source: help_ap_portaltypes
fr: Types de contenus auxquels la règle s'applique.

source: help_clear_expiration
fr: Si cette option est cochée, la date d'expiration sera effacée quand le contenu sera publié manuellement, afin d'éviter le retrait automatique immédiat.

source: help_date_index
fr: Par défaut, la date de publication (index 'effective') est utilisé pour les actions de publication et la date d'expiration (index 'expires') est utilisé pour les actions de retrait. Si une méthode personnalisée doit être utilisée pour la date, entrez index_id|object_method_id. Si index_id = method_id, entrez juste index_id.

source: help_dry_run
fr: Simule le changement d'état de processus documentaire. Les états ne seront pas changés, mais il sera possible de superviser quelles actions seront prises. Pour activer la publication automatique, décochez cette case.

source: help_email_log
fr: Si une ou plusieurs adresse courriel est fournie, le journal d'audit des actions effectuées est envoyé par courriel.

source: help_overwrite_expiration
fr: Si cette option est cochée, la date d'expiration sera écrasée avec la date et l'heure actuelle quand le contenu sera retiré manuellement, afin d'éviter la republication du contenu si une date de publication dans le passé est renseignée.

source: help_publish_actions
fr: Actions de processus documentaire initiées par la publication automatique quand la date de publication est atteinte.

source: help_retract_actions
fr: Actions de processus documentaire initiées par la publication automatique quand la date d'expiration est atteinte.

source: label_ap_contolpanel
fr: Paramètres de Publication automatique

source: label_clear_expiration
fr: Effacer la date d'expiration lors de la publication

source: label_date_index
fr: Méthode / index pour la date de déclenchement de transaction

source: label_dry_run
fr: Simuler

source: label_email_log
fr: Adresse courriel pour le journal d'audit

source: label_initial_state
fr: Etat de processus de départ

source: label_overwrite_expiration
fr: Définir la date d'expiration lors du retrait

source: label_publish_actions
fr: Actions de publication

source: label_retract_actions
fr: Actions de retrait

source: label_transition
fr: Transition depuis l'état de départ
